update thaitg_integration.itg_th_dstrbtr_customer_dim
set salesareaname = case 
    when salesareaname = 'เสรีไทย,นวมินทร์-ลาดพร้าว101,ลาดพร้าว47 -  แจ้งวัฒนะ,ห้วยข' then 
    'เสรีไทย,นวมินทร์-ลาดพร้าว101,ลาดพร้าว47 -  แจ้งวัฒนะ,ห้วยขวาง,สายไหม,ดอนเมือง,กำแพงเพชร2-ลาดพร้าว,พหลโยธิน'
    when salesareaname = 'ราม2-บางนา,ปทุมวัน,พระราม3พระราม6,สุขุมวิท,ลาดกระบัง,พระ' then 
    'ราม2-บางนา,ปทุมวัน,พระราม3พระราม6,สุขุมวิท,ลาดกระบัง,พระนคร,สุขุมวิท49,สำเพ็ง,ดินแดง,อ่อนนุช-อุดมสุข'
    when salesareaname = 'ชลบุรี ( อ.พานทอง อ.พนัสนิคม อ.เกาะจันทร์ อ.บ่อทอง ) อ.บ้าน' then 
    'ชลบุรี ( อ.พานทอง อ.พนัสนิคม อ.เกาะจันทร์ อ.บ่อทอง ) อ.บ้านบึง'
    when salesareaname = 'TFM112 กรุงเทพ,สมุทรสาคร ได้แก่ บางบอน,อ.เมืองสมุทรสาตร.บ้' then 
    'TFM112 กรุงเทพ,สมุทรสาคร ได้แก่ บางบอน,อ.เมืองสมุทรสาตร.บ้านแพ้ว,กระทุ่มแบน'
    when salesareaname = 'F20 จ.นนทบุรี,บางพลัด,บางกอกน้อย,บางกอกใหญ๋,ทวีวัฒนา,ภาษ' then 
    'F20 จ.นนทบุรี,บางพลัด,บางกอกน้อย,บางกอกใหญ๋,ทวีวัฒนา,ภาษีเจริญ,บางแค,หนองแขม,จอมทอง,ธนบุรี,คลองสาน'
    when salesareaname = 'TFM107 จ.สมุทรปราการ ได้แก่ อ.บางพลี,อ.บางบ่อ,อ.บางเสาธง,บาง' then 
    'TFM107 จ.สมุทรปราการ ได้แก่ อ.บางพลี,อ.บางบ่อ,อ.บางเสาธง,บางนา'
    else salesareaname
    end 
where salesareaname in (
'เสรีไทย,นวมินทร์-ลาดพร้าว101,ลาดพร้าว47 -  แจ้งวัฒนะ,ห้วยข',
'ราม2-บางนา,ปทุมวัน,พระราม3พระราม6,สุขุมวิท,ลาดกระบัง,พระ',
'ชลบุรี ( อ.พานทอง อ.พนัสนิคม อ.เกาะจันทร์ อ.บ่อทอง ) อ.บ้าน',
'TFM112 กรุงเทพ,สมุทรสาคร ได้แก่ บางบอน,อ.เมืองสมุทรสาตร.บ้',
'F20 จ.นนทบุรี,บางพลัด,บางกอกน้อย,บางกอกใหญ๋,ทวีวัฒนา,ภาษ',
'TFM107 จ.สมุทรปราการ ได้แก่ อ.บางพลี,อ.บางบ่อ,อ.บางเสาธง,บาง');

update thaitg_integration.itg_th_dstrbtr_customer_dim_snapshot
set salesareaname = case 
    when salesareaname = 'เสรีไทย,นวมินทร์-ลาดพร้าว101,ลาดพร้าว47 -  แจ้งวัฒนะ,ห้วยข' then 
    'เสรีไทย,นวมินทร์-ลาดพร้าว101,ลาดพร้าว47 -  แจ้งวัฒนะ,ห้วยขวาง,สายไหม,ดอนเมือง,กำแพงเพชร2-ลาดพร้าว,พหลโยธิน'
    when salesareaname = 'ราม2-บางนา,ปทุมวัน,พระราม3พระราม6,สุขุมวิท,ลาดกระบัง,พระ' then 
    'ราม2-บางนา,ปทุมวัน,พระราม3พระราม6,สุขุมวิท,ลาดกระบัง,พระนคร,สุขุมวิท49,สำเพ็ง,ดินแดง,อ่อนนุช-อุดมสุข'
    when salesareaname = 'ชลบุรี ( อ.พานทอง อ.พนัสนิคม อ.เกาะจันทร์ อ.บ่อทอง ) อ.บ้าน' then 
    'ชลบุรี ( อ.พานทอง อ.พนัสนิคม อ.เกาะจันทร์ อ.บ่อทอง ) อ.บ้านบึง'
    when salesareaname = 'TFM112 กรุงเทพ,สมุทรสาคร ได้แก่ บางบอน,อ.เมืองสมุทรสาตร.บ้' then 
    'TFM112 กรุงเทพ,สมุทรสาคร ได้แก่ บางบอน,อ.เมืองสมุทรสาตร.บ้านแพ้ว,กระทุ่มแบน'
    when salesareaname = 'F20 จ.นนทบุรี,บางพลัด,บางกอกน้อย,บางกอกใหญ๋,ทวีวัฒนา,ภาษ' then 
    'F20 จ.นนทบุรี,บางพลัด,บางกอกน้อย,บางกอกใหญ๋,ทวีวัฒนา,ภาษีเจริญ,บางแค,หนองแขม,จอมทอง,ธนบุรี,คลองสาน'
    when salesareaname = 'TFM107 จ.สมุทรปราการ ได้แก่ อ.บางพลี,อ.บางบ่อ,อ.บางเสาธง,บาง' then 
    'TFM107 จ.สมุทรปราการ ได้แก่ อ.บางพลี,อ.บางบ่อ,อ.บางเสาธง,บางนา'
    else salesareaname
    end 
where salesareaname in (
'เสรีไทย,นวมินทร์-ลาดพร้าว101,ลาดพร้าว47 -  แจ้งวัฒนะ,ห้วยข',
'ราม2-บางนา,ปทุมวัน,พระราม3พระราม6,สุขุมวิท,ลาดกระบัง,พระ',
'ชลบุรี ( อ.พานทอง อ.พนัสนิคม อ.เกาะจันทร์ อ.บ่อทอง ) อ.บ้าน',
'TFM112 กรุงเทพ,สมุทรสาคร ได้แก่ บางบอน,อ.เมืองสมุทรสาตร.บ้',
'F20 จ.นนทบุรี,บางพลัด,บางกอกน้อย,บางกอกใหญ๋,ทวีวัฒนา,ภาษ',
'TFM107 จ.สมุทรปราการ ได้แก่ อ.บางพลี,อ.บางบ่อ,อ.บางเสาธง,บาง');


update thaitg_integration.itg_th_dms_chana_customer_dim
set salesareaname = case 
    when salesareaname = 'เสรีไทย,นวมินทร์-ลาดพร้าว101,ลาดพร้าว47 -  แจ้งวัฒนะ,ห้วยข' then 
    'เสรีไทย,นวมินทร์-ลาดพร้าว101,ลาดพร้าว47 -  แจ้งวัฒนะ,ห้วยขวาง,สายไหม,ดอนเมือง,กำแพงเพชร2-ลาดพร้าว,พหลโยธิน'
    when salesareaname = 'ราม2-บางนา,ปทุมวัน,พระราม3พระราม6,สุขุมวิท,ลาดกระบัง,พระ' then 
    'ราม2-บางนา,ปทุมวัน,พระราม3พระราม6,สุขุมวิท,ลาดกระบัง,พระนคร,สุขุมวิท49,สำเพ็ง,ดินแดง,อ่อนนุช-อุดมสุข'
    when salesareaname = 'ชลบุรี ( อ.พานทอง อ.พนัสนิคม อ.เกาะจันทร์ อ.บ่อทอง ) อ.บ้าน' then 
    'ชลบุรี ( อ.พานทอง อ.พนัสนิคม อ.เกาะจันทร์ อ.บ่อทอง ) อ.บ้านบึง'
    when salesareaname = 'TFM112 กรุงเทพ,สมุทรสาคร ได้แก่ บางบอน,อ.เมืองสมุทรสาตร.บ้' then 
    'TFM112 กรุงเทพ,สมุทรสาคร ได้แก่ บางบอน,อ.เมืองสมุทรสาตร.บ้านแพ้ว,กระทุ่มแบน'
    when salesareaname = 'F20 จ.นนทบุรี,บางพลัด,บางกอกน้อย,บางกอกใหญ๋,ทวีวัฒนา,ภาษ' then 
    'F20 จ.นนทบุรี,บางพลัด,บางกอกน้อย,บางกอกใหญ๋,ทวีวัฒนา,ภาษีเจริญ,บางแค,หนองแขม,จอมทอง,ธนบุรี,คลองสาน'
    when salesareaname = 'TFM107 จ.สมุทรปราการ ได้แก่ อ.บางพลี,อ.บางบ่อ,อ.บางเสาธง,บาง' then 
    'TFM107 จ.สมุทรปราการ ได้แก่ อ.บางพลี,อ.บางบ่อ,อ.บางเสาธง,บางนา'
    else salesareaname
    end 
where salesareaname in (
'เสรีไทย,นวมินทร์-ลาดพร้าว101,ลาดพร้าว47 -  แจ้งวัฒนะ,ห้วยข',
'ราม2-บางนา,ปทุมวัน,พระราม3พระราม6,สุขุมวิท,ลาดกระบัง,พระ',
'ชลบุรี ( อ.พานทอง อ.พนัสนิคม อ.เกาะจันทร์ อ.บ่อทอง ) อ.บ้าน',
'TFM112 กรุงเทพ,สมุทรสาคร ได้แก่ บางบอน,อ.เมืองสมุทรสาตร.บ้',
'F20 จ.นนทบุรี,บางพลัด,บางกอกน้อย,บางกอกใหญ๋,ทวีวัฒนา,ภาษ',
'TFM107 จ.สมุทรปราการ ได้แก่ อ.บางพลี,อ.บางบ่อ,อ.บางเสาธง,บาง');
